/*
    12.考虑下面两个无限序列：
    1.0 + 1.0/2.0 + 1.0/3.0 + 1.0/4.0 + ...
    1.0 - 1.0/2.0 + 1.0/3.0 - 1.0/4.0 + ...
    编写一个程序计算这两个无限序列的总和，直到到达某次数。提示：奇数个-1  相乘得-1，偶数个-1相乘得1。让用户交互地输入指定的次数，当用户输入0或负值时结束输入。查看运行100项、1000项、10000项后的总和，是否发现每个序列都收敛于某值？
*/

#include <stdio.h>
int main(void)
{
    int n;
    double sum1 = 0.0, sum2 = 0.0;
    printf("Enter the number of terms:");
    scanf("%d", &n);

    for (int i = 1; i <= n; i++)
    {
        sum1 += 1.0 / i;
        sum2 += (i % 2 == 1 ? 1.0 : -1.0) / i;
    }
    printf("The sum of 1.0 + 1.0/2.0 + 1.0/3.0 + 1.0/4.0 + ... is %.4f\n", sum1);
    printf("The sum of 1.0 - 1.0/2.0 + 1.0/3.0 - 1.0/4.0 + ... is %.4f\n", sum2);

    return 0;
}